# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv6 object detection model with P3-P5 outputs. For Usage examples see https://docs.ultralytics.com/models/yolov6

# Parameters
nc: 6 # number of classes
activation: nn.ReLU() # (optional) model default activation function
scales: # model compound scaling constants, i.e. 'model=yolov6n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

# YOLOv6-3.0s backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 4]] # 0-P1/4  160*160
  - [-1, 1, SCIAM, [64]] #1
  - [-1, 1, Conv, [128, 3, 2]] # 2-P2/8   80*80
  - [-1, 1, SCIAM, [128]] #3
  - [-1, 1, SCIAM, [128]] #4
  - [-1, 1, Conv, [256, 3, 2]] # 5-P3/16   40*40
  - [-1, 1, SCIAM, [256]] #6
  - [-1, 1, SCIAM, [256]] #7
  - [-1, 1, SCIAM, [256]] #8
  - [-1, 1, SCIAM, [256]] #9
  - [-1, 1, SCIAM, [256]] #10
  - [-1, 1, SCIAM, [256]] #11
  - [-1, 1, SCIAM, [256]] #12
  - [-1, 1, SCIAM, [256]] #13
  - [-1, 1, Conv, [512, 3, 2]] # 14-P4/32  20*20
  - [-1, 1, SCIAM, [512]]  #15
  - [-1, 1, SCIAM, [512]]  #16
  - [-1, 1, Conv, [1024, 1, 1]] # 17  20*20
  - [-1, 1, SPPF, [1024, 5]] # 18

# YOLOv6-3.0s head
head:
  - [-1, 1, Conv, [256, 1, 1]]
  - [-1, 1, nn.ConvTranspose2d, [256, 2, 2, 0]]
  - [[-1, 13], 1, Concat, [1]] # cat backbone P4
  - [-1, 1, Conv, [256, 3, 1]]
  - [-1, 9, Conv, [256, 3, 1]] # 23

  - [-1, 1, Conv, [128, 1, 1]]
  - [-1, 1, nn.ConvTranspose2d, [128, 2, 2, 0]]
  - [[-1, 4], 1, Concat, [1]] # cat backbone P3
  - [-1, 1, Conv, [128, 3, 1]]
  - [-1, 9, Conv, [128, 3, 1]] # 28

  - [-1, 1, Conv, [128, 3, 2]]
  - [[-1, 24], 1, Concat, [1]] # cat head P4
  - [-1, 1, Conv, [256, 3, 1]]
  - [-1, 9, Conv, [256, 3, 1]] # 32

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 19], 1, Concat, [1]] # cat head P5
  - [-1, 1, Conv, [512, 3, 1]]
  - [-1, 9, Conv, [512, 3, 1]] # 36

  - [[28, 32, 36], 1, Detect, [nc]] # Detect(P3, P4, P5)
