# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv5 object detection model with P3-P5 outputs. For details see https://docs.ultralytics.com/models/yolov5

# Parameters
nc: 6  # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov5n.yaml' will call yolov5.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 1024]
  l: [1.00, 1.00, 1024]
  x: [1.33, 1.25, 1024]

# YOLOv5 v6.0 backbone
backbone:
  # [from, repeats, module, args]
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 4]] # 0-P1/4  160*160
  - [-1, 1, SCIAM, [64]] #1
  - [-1, 1, Conv, [128, 3, 2]] # 2-P2/8   80*80
  - [-1, 1, SCIAM, [128]] #3
  - [-1, 1, SCIAM, [128]] #4
  - [-1, 1, Conv, [256, 3, 2]] # 5-P3/16   40*40
  - [-1, 1, SCIAM, [256]] #6
  - [-1, 1, SCIAM, [256]] #7
  - [-1, 1, SCIAM, [256]] #8
  - [-1, 1, SCIAM, [256]] #9
  - [-1, 1, SCIAM, [256]] #10
  - [-1, 1, SCIAM, [256]] #11
  - [-1, 1, SCIAM, [256]] #12
  - [-1, 1, SCIAM, [256]] #13
  - [-1, 1, Conv, [512, 3, 2]] # 14-P4/32  20*20
  - [-1, 1, SCIAM, [512]]  #15
  - [-1, 1, SCIAM, [512]]  #16
  - [-1, 1, Conv, [1024, 1, 1]] # 17  20*20
  - [-1, 1, SPPF, [1024, 5]] # 18

# YOLOv5 v6.0 head
head:
  [[-1, 1, Conv, [512, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 13], 1, Concat, [1]],  # cat backbone P4
   [-1, 3, C3, [512, False]],  # 22

   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 4], 1, Concat, [1]],  # cat backbone P3
   [-1, 3, C3, [256, False]],  # 26 (P3/8-small)

   [-1, 1, Conv, [256, 3, 2]],
   [[-1, 23], 1, Concat, [1]],  # cat head P4
   [-1, 3, C3, [512, False]],  # 29 (P4/16-medium)

   [-1, 1, Conv, [512, 3, 2]],
   [[-1, 19], 1, Concat, [1]],  # cat head P5
   [-1, 3, C3, [1024, False]],  # 32 (P5/32-large)

   [[26, 29, 32], 1, Detect, [nc]],  # Detect(P3, P4, P5)
  ]
