# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv3 object detection model with P3-P5 outputs. For details see https://docs.ultralytics.com/models/yolov3

# Parameters
nc: 6 # number of classes
depth_multiple: 1.0 # model depth multiple
width_multiple: 1.0 # layer channel multiple

# darknet53 backbone
backbone:
  # [from, number, module, args]
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 4]] # 0-P1/4  160*160
  - [-1, 1, SCIAM, [64]] #1
  - [-1, 1, Conv, [128, 3, 2]] # 2-P2/8   80*80
  - [-1, 1, SCIAM, [128]] #3
  - [-1, 1, SCIAM, [128]] #4
  - [-1, 1, Conv, [256, 3, 2]] # 5-P3/16   40*40
  - [-1, 1, SCIAM, [256]] #6
  - [-1, 1, SCIAM, [256]] #7
  - [-1, 1, SCIAM, [256]] #8
  - [-1, 1, SCIAM, [256]] #9
  - [-1, 1, SCIAM, [256]] #10
  - [-1, 1, SCIAM, [256]] #11
  - [-1, 1, SCIAM, [256]] #12
  - [-1, 1, SCIAM, [256]] #13
  - [-1, 1, Conv, [512, 3, 2]] # 14-P4/32  20*20
  - [-1, 1, SCIAM, [512]]  #15
  - [-1, 1, SCIAM, [512]]  #16
  - [-1, 1, Conv, [1024, 1, 1]] # 17  20*20

# YOLOv3 head
head:
  - [-1, 1, Bottleneck, [1024, False]]
  - [-1, 1, Conv, [512, 1, 1]]
  - [-1, 1, Conv, [1024, 3, 1]]
  - [-1, 1, Conv, [512, 1, 1]]
  - [-1, 1, Conv, [1024, 3, 1]] # 22 (P5/32-large)

  - [-2, 1, Conv, [256, 1, 1]]
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 13], 1, Concat, [1]] # cat backbone P4
  - [-1, 1, Bottleneck, [512, False]]
  - [-1, 1, Bottleneck, [512, False]]
  - [-1, 1, Conv, [256, 1, 1]]
  - [-1, 1, Conv, [512, 3, 1]] # 29 (P4/16-medium)

  - [-2, 1, Conv, [128, 1, 1]]
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]] # cat backbone P3
  - [-1, 1, Bottleneck, [256, False]]
  - [-1, 2, Bottleneck, [256, False]] # 34 (P3/8-small)

  - [[34, 29, 22], 1, Detect, [nc]] # Detect(P3, P4, P5)
